[AshFlameViperM1 X2CharacterTemplate]
strCharacterName="Flame Viper"

[AshFlameViperM2 X2CharacterTemplate]
strCharacterName="Magma Viper"

[AshFlameViperM3 X2CharacterTemplate]
strCharacterName="Inferno Viper"

[Weapon_AshFlameViperInfernoRifle X2WeaponTemplate]
FriendlyName="Inferno Rifle"

[Weapon_AshFlameViperSpitM1 X2WeaponTemplate]
FriendlyName="Flame Spit"

[Weapon_AshFlameViperSpitM2 X2WeaponTemplate]
FriendlyName="Flame Spit"

[Weapon_AshFlameViperSpitM3 X2WeaponTemplate]
FriendlyName="Flame Spit"

[Ability_AshFlameViperSpit X2AbilityTemplate]
LocFriendlyName="Flame Spit"
LocLongDescription="Spit a blast of flame at a target."
LocHelpText="Spit a blast of flame at a target."
LocFlyOverText="Flame Spit"

[Ability_AshSeethingM1 X2AbilityTemplate]
LocFriendlyName="Seething"
LocLongDescription="Increase many offensive and defensive stats."
LocHelpText="Send the Flame Viper into a seething rage."

[Ability_AshSeethingM2 X2AbilityTemplate]
LocFriendlyName="Seething"
LocLongDescription="Increase many offensive and defensive stats."
LocHelpText="Send the Flame Viper into a seething rage."

[Ability_AshSeethingM3 X2AbilityTemplate]
LocFriendlyName="Seething"
LocLongDescription="Increase many offensive and defensive stats."
LocHelpText="Send the Flame Viper into a seething rage."

[UtilityItem_AshFlameScaleVest X2EquipmentTemplate]
FriendlyName = "Flame Scale Vest"
FriendlyNamePlural="Flame Scale Vests"
TacticalText="<bullet/> A lightweight vest that increases soldier health, dodge, and armor, but does not hinder mobility.\n<bullet/> Provides immunity to fire."
BriefSummary = "Utilizing scales of a Flame Viper, we have created a light weight vest that increases our soldiers' survivability in the field and protects from fire."

[UtilityItem_AshInfernoRounds X2AmmoTemplate]
FriendlyName = "Inferno Rounds"
FriendlyNamePlural="Inferno Rounds"
BriefSummary="Incorporating the mixtures found within a Flame Viper's glands into an explosive cap, we can create a specialized round that inflicts substantial damage on impact as well as sets the target on fire."
TacticalText="<bullet/> These rounds inflict extra damage and set the target aflame."

[UtilityItem_AshViperRounds X2AmmoTemplate]
FriendlyName = "Viper Rounds"
FriendlyNamePlural="Viper Rounds"
BriefSummary="Combining the mixtures found within a Viper's poison glands with our own experimental ammo, we can produce a more effective venom round."
TacticalText="<bullet/> These rounds inflict extra damage and poison the target."

[Corpse_AshFlameViper X2ItemTemplate]
FriendlyName="Flame Viper Corpse"
FriendlyNamePlural="Flame Viper Corpses"
BriefSummary="Unlike the typical Vipers that spit deadly venom, this specialized Viper has the ability to spit fire across the battle field, setting anything touched ablaze."

[Autopsy_AshFlameViper X2TechTemplate]
DisplayName="Flame Viper Autopsy"
Summary="This variation of the Viper alien shares the same deadly speed and strength as the previously encountered species.  Lacking the typical viper venom, it carries a mixture in its glands that is highly flammable when mixed with the air."
CodeName="Salamander"
LongDescription="Now that the aliens no longer have a need for the Vipers to serve as an infiltration unit, it seems that the genetic experimentation performed on this species has turned towards combat effectiveness.  This Flame Viper, as the soldiers in the field have come to call it, does not possess the same venom glands as other Vipers.  Instead it carries 2 separate glands that excrete different chemicals.  When mixed together and exposed to the air, the result is highly flammable.  The Viper itself has, of course, been modified such that its scales make it impervious to fire.  It would seem that Fire Breathing Dragons are now very real.  Science has produced a creature that has only ever existed previously in fantasy.  R. Tygan."